package com.internal.playment.common.enums;


import lombok.Getter;

@Getter
public enum ResponseCodeEnum {
     RXH00000("RXH00000","交易成功")
    ,RXH00001("RXH00001","卡号错误")
    ,RXH00002("RXH00002","卡信息或手机号码错误")
    ,RXH00003("RXH00003","请重新获取验证码")
    ,RXH00004("RXH00004","短信验证码错误")
    ,RXH00005("RXH00005","短信验证码发送失败")
    ,RXH00006("RXH00006","协议不存在")
    ,RXH00007("RXH00007","交易异常,请查询交易")
    ,RXH00008("RXH00008","原交易不存在或原交易已完成代付")
    ,RXH00009("RXH00009","订单号已经存在")
    ,RXH00010("RXH00010","余额不足")
    ,RXH00011("RXH00011","代付金额大于可支付金额")
    ,RXH00012("RXH00012","单笔金额超过单笔最大额度")
    ,RXH00013("RXH00013","请求参数为空")
    ,RXH00014("RXH00014","缺少必要参数")
    ,RXH00015("RXH00015","字段值长度异常")
    ,RXH00016("RXH00016","字段值格式错误")
    ,RXH00017("RXH00017","该商户号不存在")
    ,RXH00018("RXH00018","签名不匹配")
    ,RXH00019("RXH00019","商户通道未进行配置")
    ,RXH00020("RXH00020","商户配置通道未进行开放")
    ,RXH00021("RXH00021","产品类型不存在,或未开启该产品")
    ,RXH00022("RXH00022","通道不匹配,或者通道未开启")
    ,RXH00023("RXH00023","无更多可用通道")
    ,RXH00024("RXH00024","未找到合适的进件附属通道,或者进件附属通道未开启")
    ,RXH00025("RXH00025","平台订单号不存在")
    ,RXH00026("RXH00026","附属通道不匹配")
    ,RXH00027("RXH00027","进件主表信息不匹配")
    ,RXH00028("RXH00028","该卡已经有成功绑卡记录")
    ,RXH00029("RXH00029","该卡已经有成功进件记录")
    ,RXH00030("RXH00030","未找到成功业务开通记录")
    ,RXH00031("RXH00031","请先进行进件操作，再进行绑卡操作")
    ,RXH00032("RXH00032","平台订单号无效")
    ,RXH00033("RXH00033","未找到成功绑卡记录")
    ,RXH00034("RXH00034","未找到该卡成功绑卡记录")
    ,RXH00035("RXH00035","商户风控对象不存在")
    ,RXH00036("RXH00036","超出单日最大限额")
    ,RXH00037("RXH00037","超出单月最大限额")
    ,RXH00038("RXH00038","单笔金额不低于通道最低限度")
    ,RXH00039("RXH00039","单笔金额不大于通道最高限度")
    ,RXH00040("RXH00040","该产品类型没有可用的通道")
    ,RXH00041("RXH00041","该产品类型商户费率不存在")
    ,RXH00042("RXH00042","payFree设置过低，导致商户费率过大")
    ,RXH00043("RXH00043","payFree设置过低，导致通道费率过大")
    ,RXH00044("RXH00044","内部费率设置错误")
    ,RXH00045("RXH00045","已成功，无需重新操作")
    ,RXH00046("RXH00046","进件信息和绑卡信息不匹配")
    ,RXH00047("RXH00047","现有通道不可用，无其他可用通道")
    ,RXH00048("RXH00048","单次代付金额不小于 10 RMB")
    ,RXH00049("RXH00049","单次代付金额不大于 10W RMB")
    ,RXH00050("RXH00050","多笔代付订单必须同一通道标识")
    ,RXH00051("RXH00051","多笔代付必须全额代付")
    ,RXH00052("RXH00052","订单金额金额已经不足 1 RMB，无法进行代付")
    ,RXH00053("RXH00053","单次代付金额不小于 1 RMB")
    ,RXH00054("RXH00054","商户所支持的产品类型未设置或未开启")
    ,RXH00055("RXH00055","持卡人身份信息、手机号或CVV2输入不正确")
    ,RXH00056("RXH00056","你的卡已绑定，无需重复操作")
    ,RXH00057("RXH00057","此接口不支持该产品类型")
    ,RXH00058("RXH00058","未找到该订单信息")
    ,RXH00059("RXH00059","未找到任何业务开通相关记录")
    ,RXH99994("RXH99994","系统内部错误,运算过程出错")
    ,RXH99995("RXH99995","系统内部错误,通道机构已关闭")
    ,RXH99996("RXH99996","系统内部错误,数据不匹配")
    ,RXH99997("RXH99997","系统内部错误，网络通讯异常")
    ,RXH99998("RXH99998","系统内部错误，数据缺失，请重新发起收单申请")
    ,RXH99999("RXH99999","其他错误");

    private String code;
    private String msg;

    ResponseCodeEnum(String code, String msg){
        this.code = code;
        this.msg = msg;
    }
}
